# IdeaStatiCa.ConnectionApi.Model.ParameterData

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Id** | **int** |  | [optional]
**Identifier** | **string** |  | [optional]
**Description** | **string** |  | [optional]
**ParameterType** | **string** |  | [optional]
**Value** | **Object** |  | [optional]
**DefaultValue** | **Object** |  | [optional]
**EvaluatedValue** | **Object** |  | [optional]
**EvaluatedDefaultValue** | **Object** |  | [optional]
**ValidationValue** | **string** |  | [optional]
**EvaluatedValidationValue** | **string** |  | [optional]
**ValidationType** | **ValidationType** |  | [optional]
**UserUnitId** | **int** |  | [optional]
**IsVisibleForSimpleConnection** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)